<template>
  <v-container
    class="letter_wrap rounded-xl py-12 my-12 elevation-12 text-h6 font-weight-light text--primary"
    :class="$vuetify.breakpoint.smAndDown ? 'px-5' : 'px-16'"
    style="line-height: 1.8rem;"
  >
    <div class="text-h4 text-center mb-5">
      Правила размещения писем
    </div>
    <p>
      <span class="first-letter">М</span>ы убеждены, что абсолютное большинство посетителей этого сайта — порядочные люди. Но чтобы исключить саму возможность преднамеренного или непреднамеренного оскорбления нашей аудитории — мы ввели правила размещения писем на нашем сайте.
    </p>
    <p>
      Перед публикацией письма модерируются. Наш модератор прежде всего проверяет — соответствует ли письмо перечню требований к публикации и вносит, если это необходимо, небольшие корректировки - устраняет явные грамматические и орфографические ошибки, правильно располагает контент внутри письма (отступы, запятые, переносы слов, картинки и др.) для того, чтобы письмо выглядело привлекательно и точнее раскрывало суть послания.
    </p>
    <p>
      Мы ни в коем случае НЕ МЕНЯЕМ смысл послания и фактические данные. Если требуется внести корректировки в письмо уже после его публикации, либо удалить / снять письмо с публикации - пишите администратору на e-mail, указанный внизу сайта с почты, которую Вы указывали при публикации письма.
    </p>
    <p class="font-weight-regular">
      Перечень требований к публикации:
    </p>
    </p>
    <div class="grey lighten-3 pa-5">
      <p>
        <v-chip dark color="orange" class="mr-2 font-weight-medium text-body-1" small>
          1
        </v-chip> Письмо не должно содержать материалов оскорбительного характера по любым признакам и для любых социальных групп. Это относится как к тексту, так и к аватару, если он выбран. Недопустимо использовать нашу площадку для политических заявлений, разжигания ненависти или пропаганды чего-либо.
      </p>
      <p>
        <v-chip dark color="orange" class="mr-2 font-weight-medium text-body-1" small>
          2
        </v-chip> Письмо не должно содержать ненормативной лексики, жаргонных выражений. Сленг допустим, если он не носит оскорбительного характера и естественен в контексте письма.
      </p>
      <p>
        <v-chip dark color="orange" class="mr-2 font-weight-medium text-body-1" small>
          3
        </v-chip> Письмо не должно содержать явной или скрытой рекламы, ссылок рекламного характера на внешние ресурсы.
      </p>
    </div>
    <p class="mt-5">
      Если эти простые правила устраивают Вас — добро пожаловать! После модерации письмо будет опубликованно в кратчайшие сроки и Вам на почту придёт уведомление о публикации (если Вы её указывали). Для не прошедших модерацию писем уведомления не рассылаются.
    </p>
    <div class="text-h4 text-center my-5">
      Общая информация
    </div>
    <div class="grey lighten-3 pa-5">
      <p>
        <v-chip dark color="indigo" class="mr-2 font-weight-medium text-body-1" small>
          1
        </v-chip> Услуга предоставляется "как есть" и в том виде, в котором она доступна на момент предоставления, при этом никаких гарантий её доступности или пригодности для целей использования, прямых или косвенных, не предоставляется.
      </p>
      <p>
        <v-chip dark color="indigo" class="mr-2 font-weight-medium text-body-1" small>
          2
        </v-chip> Владелец данного сайта оставляет за собой право без предварительного уведомления вносить изменения в структуру контента (информационного содержимого) сайта, перемещать и сортировать размещенные на нем материалы, дополнять и развивать техническую платформу сервиса (что может повлечь за собой изменения дизайна, структуры страниц, систем навигации и поиска, гиперссылок).
      </p>
      <p>
        <v-chip dark color="indigo" class="mr-2 font-weight-medium text-body-1" small>
          3
        </v-chip> Следует помнить и отдавать себе отчёт в том, что опубликованное письмо — это публичная интернет-страница, которая может содержать информацию о человеке, коллективе или организации, которым она адресована. Данная страница создается автором письма, который несет личную ответственность за достоверность указанных в ней данных. В случае, если содержимое письма нарушает авторские или иные права третьих лиц или законодательство Российской Федерации — ответственность за это также возлагается на автора письма.
      </p>
    </div>
    <div v-if="$vuetify.breakpoint.smAndUp" class="text-center mt-10">
      <v-btn-toggle
        rounded
      >
        <v-btn
          color="orange"
          dark
          x-large
          nuxt
          to="/letter"
        >
          <span class="pl-3">Написать письмо</span>
        </v-btn>
        <v-btn
          color="orange"
          dark
          x-large
          nuxt
          to="/"
        >
          <span class="pr-3">На главную</span>
        </v-btn>
      </v-btn-toggle>
    </div>
    <v-row v-else align="center" :justify="$vuetify.breakpoint.xsOnly ? 'center' : 'space-between'" class="mt-5">
      <v-btn
        color="indigo"
        text
        nuxt
        to="/letter"
      >
        Написать письмо
      </v-btn>
      <v-btn
        color="indigo"
        text
        nuxt
        to="/"
      >
        На главную
      </v-btn>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head () {
    return {
      title: 'Правила размещения писем',
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: 'Мы убеждены, что абсолютное большинство посетителей этого сайта — порядочные люди. Но чтобы исключить саму возможность преднамеренного или непреднамеренного оскорбления нашей аудитории — мы ввели правила размещения писем на нашем сайте. Перед публикацией письма модерируются. Наш модератор прежде всего проверяет — соответствует ли письмо перечню требований к публикации и вносит, если это необходимо, небольшие корректировки.'
        }
      ]
    }
  }
}
</script>
